{"ongc": [["Oil & Natural Gas Corporation Limited has informed the Exchange regarding a press release dated Jun 19, 2019, titled \"Press Release w.r.t. Subsidiary company - ONGC Videsh Limited\".", [0.069, 0.839, 0.091, 0.1531]], ["Press Release w.r.t. Subsidiary company  ONGC Videsh Limited, a wholly-owned subsidiary of the Company, along with its joint venture partners of Mozambique Rovuma Offshore Area 1 announces Final Investment Decision for initial two LNG train Project Development. In this regard a ''''Press Release'''' is being issued as per attachment", [0.04, 0.915, 0.046, 0.0772]], ["Intimation under the SEBI (Prohibition of Insider Trading) Regulations, 2015", [0.0, 1.0, 0.0, 0.0]], ["Oil & Natural Gas Corporation Ltd has informed BSE that the Board of Directors of the Company at its Meeting held on May 30, 2019, inter alia, have recommended a final dividend @ Rs. 0.75/- (Seventy five paisa only) per equity share of Rs. 5/- each, for the Financial Year 2018-19, subject to necessary approval of members at the ensuing Annual General Meeting.", [0.0, 0.854, 0.146, 0.8225]], ["In terms of Regulation 30 and 33 of the SEBI (Listing Obligation and Disclosure Requirements), Regulations, 2015, we submit herewith Standalone and Consolidated Audited Financial Results for the quarter/ year ended 31st March, 2019 along with Audit Report for Financial Year ended 31st March 2019.", [0.0, 1.0, 0.0, 0.0]], ["Intimation regarding issue of duplicate shares", [0.0, 0.694, 0.306, 0.296]], ["Oil & Natural Gas Corporation Ltd has informed BSE that a meeting of the Board of Directors of the Company is scheduled to be held on May 30, 2019, inter alia, to consider and approve the standalone and consolidated audited Financial Results of the Company for the quarter and year ended March 31, 2019 and recommendation of Final Dividend, if any, for the year 2018-19, subject to approval of the shareholders.", [0.0, 0.923, 0.077, 0.6808]], ["OIL AND NATURAL GAS CORPORATION LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/05/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1) read with Regulation 33 of the SEBI Listing Obligations and Disclosure Requirements) Regulations, 2015 we hereby inform that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday, the 30th May, 2019, inter-alia, to consider and approve the standalone and consolidated audited Financial Results of the Company for the quarter and year ended 31st March, 2019 and recommendation of Final Dividend, if any, for the year 2018-19, subject to approval of the shareholders.", [0.0, 0.946, 0.054, 0.7456]], ["Intimation regarding issue of duplicate shares", [0.0, 0.694, 0.306, 0.296]], ["Format of Initial Disclosure to be made by an entity identified as a Large Corporate.  Sr. No. Particulars Details  1Name of CompayOIL AND NATURAL GAS CORPORATION LTD. 2CININE213A01029 3 Outstanding borrowing of company as on 31st March / 31st December, as applicable (in Rs cr) 0 4Highest Credit Rating during the previous FY NA 4aName of the Credit Rating Agency issuing the Credit Rating mentioned in (4)Not Applicable 5Name of Stock Exchange# in which the fine shall be paid, in case of shortfall in the required borrowing under the frameworkBSE     We confirm that we are a Large Corporate as per the applicability criteria given under the SEBI circular SEBI/HO/DDHS/CIR/P/2018/144 dated November 26, 2018. No   Name of the Company Secretary: M E V SELVAMM   Designation: COMPANY SECRETARY  EmailId: selvamm_mev@ongc.co.in  Name of the Chief Financial Officer: SUBHASH KUMAR  Designation: DIRECTOR (FINANCE)  EmailId: dir_fin@ongc.co.in    Date: 29/04/2019 Note: In terms para of 3.2(ii) of the circular, beginning F.Y 2022, in the event of shortfall in the mandatory borrowing through debt securities, a fine of 0.2% of the shortfall shall be levied by Stock Exchanges at the end of the two-year block period. Therefore, an entity identified as LC shall provide, in its initial disclosure for a financial year, the name of Stock Exchange to which it would pay the fine in case of shortfall in the mandatory borrowing through debt markets. ", [0.057, 0.837, 0.106, 0.8602]]], "sbin": [["With reference to news appeared in www.asianage.com dated June 18, 2019 quoting \"Jet Air lands in NCLT as banks give up on revival\", State Bank of India has submitted to BSE a copy of Clarification is enclosed.", [0.0, 1.0, 0.0, 0.0]], ["Disclosure under Regulation 44(3) and 30 of SEBI (LODR) Regulations 2015: Outcome of 64th Annual General Meeting", [0.0, 1.0, 0.0, 0.0]], ["Disclosure under Regulation 30 of SEBI (LODR) Regulations 2015", [0.0, 1.0, 0.0, 0.0]], ["State Bank Of India has informed the Exchange regarding Analysts/Institutional Investor Meet/Con. Call Updates", [0.0, 1.0, 0.0, 0.0]], ["The Exchange has sought clarification from State Bank of India on June 18, 2019, with reference to news appeared in www.asianage.com dated June 18, 2019 quoting \"Jet Air lands in NCLT as banks give up on revival\"The reply is awaited.", [0.027, 0.973, 0.0, -0.0258]], ["Disclosure under Regulation 30 of SEBI (LODR) Regulations 2015", [0.0, 1.0, 0.0, 0.0]], ["The Exchange had sought clarification from State Bank of India with reference to the media report, \"SBI, banks gave defaulting Sterling owners Rs 1.3k cr guarantees\".State Bank of India response is enclosed.", [0.0, 1.0, 0.0, 0.0]], ["The Exchange has sought clarification from State Bank Of India with respect to news item captioned ??SBI, banks gave defaulting Sterling owners Rs 1.3k cr guarantees??. The response from the Company is awaited.", [0.03, 0.857, 0.112, 0.6072]], ["Intimation under Regulation 30 of SEBI (LODR) Regulations 2015", [0.0, 1.0, 0.0, 0.0]], ["Intimation under Regulation 39(3) of SEBI (LODR) Regulations 2015", [0.0, 1.0, 0.0, 0.0]]],"tatamotors": [["Tata Motors slips 3% on Moody's downgrade", [0.0, 1.0, 0.0, 0.0]], ["Moody's downgrades Tata Motors with negative outlook on JLR worries", [0.448, 0.552, 0.0, -0.7579]], ["Hold Tata Motors; target of Rs 185: ICICI Direct", [0.0, 1.0, 0.0, 0.0]], ["If Nifty holds 11,780, bounceback towards 12,050 possible", [0.0, 0.722, 0.278, 0.4019]], ["Buy on dips as long as Nifty trades above crucial support of 11,780; Tata Motors among 5 stocks to bet on", [0.0, 0.769, 0.231, 0.6597]], ["Accumulate Tata Motors; target of Rs 192: Prabhudas Lilladher", [0.0, 1.0, 0.0, 0.0]], ["Stocks in the news: Tata Motors, Wipro, SAIL, Music Broadcast, PFC, Tiger Logistics, Reliance Nippon", [0.0, 1.0, 0.0, 0.0]], ["Tata Motors global sales dip 23% in May", [0.0, 1.0, 0.0, 0.0]], ["Tata Motors falls after weak UK sales by Jaguar Land Rover", [0.225, 0.775, 0.0, -0.4404]], ["Summer of discontent: No let-up in sales gloom for automakers", [0.42, 0.58, 0.0, -0.7003]]], "techm": [["Hold Tech Mahindra; target of Rs 845: ICICI Direct", [0.0, 1.0, 0.0, 0.0]], ["Tech Mahindra inks deal with Airbus for cabin, cargo design engineering", [0.0, 1.0, 0.0, 0.0]], ["Accumulate Tech Mahindra; target of Rs 880: Dolat Capital", [0.0, 1.0, 0.0, 0.0]], ["Buy Tech Mahindra; target of Rs 900: Motilal Oswal", [0.0, 1.0, 0.0, 0.0]], ["Tech Mahindra collaborates with Cisco, deploys solutions at Hyderabad campus", [0.0, 0.841, 0.159, 0.1779]], ["India Inc cheers Modi-led BJP's victory, but calls for inclusive economic growth", [0.0, 0.647, 0.353, 0.6652]], ["Tech Mahindra betting big on telecom sector's revival for growth, says CFO", [0.0, 0.809, 0.191, 0.3818]], ["What should investors do with Tech Mahindra post Q4: buy, sell or hold?", [0.0, 1.0, 0.0, 0.0]], ["Ideas for Profit | Tech Mahindra posts a subdued Q4; caution advised", [0.0, 0.756, 0.244, 0.4404]], ["Tech Mahindra Consolidated March 2019 Net Sales at Rs 8,892.30 crore, up 10.4% Y-o-Y", [0.0, 1.0, 0.0, 0.0]]], "tatasteel": [["Tata Steel Europe CEO Hans Fischer to step down", [0.0, 1.0, 0.0, 0.0]], ["Indian steel industry to outperform global peers; 6 stocks that can return in double digits", [0.0, 1.0, 0.0, 0.0]], ["In a first, Tata Steel ventures into steel scrap recycling", [0.0, 1.0, 0.0, 0.0]], ["Tata Steel, JSW Steel fall 2% as CLSA turns bearish on earnings risk", [0.149, 0.851, 0.0, -0.2732]], ["Tata Steel ends 5% higher, ends 4-day losing streak after Goldman Sachs maintains buy", [0.167, 0.833, 0.0, -0.3818]], ["Stocks in the news: Tata Steel, DHFL, Yes Bank, Voltas, India Cements, Adani Green, Suzlon", [0.0, 0.838, 0.162, 0.4019]], ["EU blocks Thyssenkrupp-Tata steel merger plan", [0.275, 0.725, 0.0, -0.2263]], ["Here's how to use covered calls to reduce cost of holding a stock", [0.0, 1.0, 0.0, 0.0]], ["Hold Tata Steel; target of Rs 475: ICICI Direct", [0.0, 1.0, 0.0, 0.0]], ["NCLT approves Tata Steel takeover of Bhushan Energy", [0.0, 0.556, 0.444, 0.5859]], ["Indias coal import rises 13% to 21 MT in April", [0.0, 1.0, 0.0, 0.0]]], "bajaj": [["Accumulate Bajaj Auto; target of Rs 3631: Arihant Capital", [0.0, 1.0, 0.0, 0.0]], ["Buy Bajaj Auto; target of Rs 3484: KR Choksey", [0.0, 1.0, 0.0, 0.0]], ["Exclusive | Aprilia 150cc twins launch put on backburner; Piaggio to focus on EVs, BS-VI", [0.0, 0.897, 0.103, 0.128]], ["Buy Bajaj Auto; target of Rs 3330: HDFC Securities", [0.0, 0.784, 0.216, 0.296]], ["Bajaj Auto sales rise 3% in May to 4.19 lakh units", [0.0, 1.0, 0.0, 0.0]], ["Bajaj Auto gains 3% after May sales beat analyst expectations", [0.0, 0.789, 0.211, 0.34]], ["Bajaj Auto’s margin to remain lower than historical highs, eyes ‘complete product portfolio’", [0.155, 0.845, 0.0, -0.296]], ["Hold Bajaj Auto; target of Rs 3250: Sharekhan", [0.0, 1.0, 0.0, 0.0]], ["Lawsuit filed against Royal Enfield in the US on patent violation", [0.362, 0.638, 0.0, -0.6249]], ["Ideas for Profit|Bajaj Auto Q4: Margin hurts, but long-term outlook positive", [0.129, 0.564, 0.307, 0.5927]]]}